# VIH Data SQL Analysis - Democratic Republic of Congo
## SQL Queries for Data Analysis using SQLite

**Author:** Bienvenu Mwenyemali  
**Date:** February 2026  
**Description:** SQL analysis of HIV/AIDS data demonstrating SQL skills with data extraction, aggregation, window functions, and advanced analytics

---

This notebook allows you to run SQL queries directly in Jupyter Notebook or Google Colab using SQLite.

## Section 1: Setup and Data Loading

In [1]:
# Install required packages (uncomment if needed)
# !pip install pandas openpyxl

In [2]:
import pandas as pd
import sqlite3
from IPython.display import display

print("Libraries imported successfully!")

Libraries imported successfully!

In [3]:
# Load data from Excel
df = pd.read_excel('datavih.xlsx')
print(f"Data loaded: {df.shape[0]} rows x {df.shape[1]} columns")
print(f"Columns: {df.columns.tolist()}")

Data loaded: 85811 rows x 8 columns
Columns: ['provinces', 'annees', 'trimestres', 'indicateurs', 'cibles', 'sexes', 'tranches_ages', 'Valeur']

In [4]:
# Create SQLite database in memory
conn = sqlite3.connect(':memory:')

# Load data into SQLite table
df.to_sql('vih_data', conn, index=False, if_exists='replace')

print("Database created and data loaded into 'vih_data' table!")

Database created and data loaded into 'vih_data' table!

In [5]:
# Helper function to run SQL queries
def run_sql(query, conn=conn):
    """
    Execute SQL query and return results as DataFrame
    """
    return pd.read_sql_query(query, conn)

print("Helper function created: run_sql(query)")

Helper function created: run_sql(query)

## Section 2: Basic Data Exploration

In [6]:
# 2.1 View first 10 records
query = """
SELECT * FROM vih_data LIMIT 10
"""
print("First 10 records:")
display(run_sql(query))

First 10 records:

,provinces,annees,trimestres,indicateurs,cibles,sexes,tranches_ages,Valeur
0,Haut-Katanga,2020,T1,Nombre de préservatifs masculins distribués,Population Générale,Masculin,15 à 19 ans,1232
1,Haut-Katanga,2020,T1,Nombre de préservatifs masculins distribués,Population Générale,Masculin,25 à 49 ans,109765
2,Haut-Katanga,2020,T1,Nombre de préservatifs masculins distribués,Population Générale,Féminin,15 à 19 ans,21345
3,Haut-Katanga,2020,T1,Nombre de préservatifs masculins distribués,Population Générale,Masculin,15 à 19 ans,15898
4,Haut-Katanga,2020,T1,Nombre de préservatifs masculins distribués,Population Générale,Masculin,>= 50 ans,56424
5,Haut-Katanga,2020,T1,Nombre de préservatifs masculins distribués,Population Générale,Féminin,>= 50 ans,49512
6,Haut-Katanga,2020,T1,Nombre de préservatifs masculins distribués,Population Générale,Féminin,20 à 24 ans,56120
7,Haut-Katanga,2020,T1,Nombre de préservatifs masculins distribués,Population Générale,Masculin,20 à 24 ans,76549
8,Haut-Katanga,2020,T1,Nombre de préservatifs masculins distribués,Population Générale,Féminin,25 à 49 ans,188765
9,Haut-Katanga,2020,T2,Nombre de préservatifs masculins distribués,Miniers / Creuseurs,Masculin,15 à 19 ans,4500

In [7]:
# 2.2 Count total records
query = """
SELECT COUNT(*) AS total_records FROM vih_data
"""
print("Total Records:")
display(run_sql(query))

Total Records:

   total_records
0          85811

In [8]:
# 2.3 Count distinct values
query = """
SELECT 
    COUNT(DISTINCT provinces) AS nb_provinces,
    COUNT(DISTINCT annees) AS nb_years,
    COUNT(DISTINCT trimestres) AS nb_quarters,
    COUNT(DISTINCT indicateurs) AS nb_indicators,
    COUNT(DISTINCT sexes) AS nb_genders,
    COUNT(DISTINCT tranches_ages) AS nb_age_groups
FROM vih_data
"""
print("Distinct Values Count:")
display(run_sql(query))

Distinct Values Count:

,nb_provinces,nb_years,nb_quarters,nb_indicators,nb_genders,nb_age_groups
0,26,5,4,118,2,8

In [9]:
# 2.4 View distinct provinces
query = """
SELECT DISTINCT provinces 
FROM vih_data 
ORDER BY provinces
"""
print("All 26 Provinces of DRC:")
display(run_sql(query))

All 26 Provinces of DRC:

         provinces
0         Bas-Uele
1     Haut-Katanga
2      Haut-Lomami
3        Haut-Uele
4            Ituri
5            Kasaï
6    Kasaï-Central
7   Kasaï-Oriental
8         Kinshasa
9    Kongo-Central
10          Kwango
11           Kwilu
12          Lomami
13         Lualaba
14      Mai-Ndombe
15         Maniema
16         Mongala
17       Nord-Kivu
18     Nord-Ubangi
19         Sankuru
20        Sud Kivu
21      Sud-Ubangi
22      Tanganyika
23          Tshopo
24         Tshuapa
25        Équateur

In [10]:
# 2.5 View distinct years
query = """
SELECT DISTINCT annees 
FROM vih_data 
ORDER BY annees
"""
print("Years in Dataset:")
display(run_sql(query))

Years in Dataset:

   annees
0    2020
1    2021
2    2022
3    2023
4    2024

## Section 3: Descriptive Statistics

In [11]:
# 3.1 Basic statistics for Valeur column
query = """
SELECT 
    COUNT(Valeur) AS count_values,
    SUM(Valeur) AS total_sum,
    ROUND(AVG(Valeur), 2) AS average_value,
    MIN(Valeur) AS min_value,
    MAX(Valeur) AS max_value,
    MAX(Valeur) - MIN(Valeur) AS range_value
FROM vih_data
"""
print("Basic Statistics for Valeur Column:")
display(run_sql(query))

Basic Statistics for Valeur Column:

,count_values,total_sum,average_value,min_value,max_value,range_value
0,85811,14125980008,164617.36,0,1580235500,1580235500

In [12]:
# 3.2 Statistics by Province
query = """
SELECT 
    provinces,
    COUNT(*) AS nb_records,
    SUM(Valeur) AS total_value,
    ROUND(AVG(Valeur), 2) AS avg_value,
    MIN(Valeur) AS min_value,
    MAX(Valeur) AS max_value
FROM vih_data
GROUP BY provinces
ORDER BY total_value DESC
"""
print("Statistics by Province:")
display(run_sql(query))

Statistics by Province:

         provinces  nb_records  total_value   avg_value  min_value   max_value
0            Kwilu        2667  12713270325  4766880.51          1  1580235500
1     Haut-Katanga       13062    338961234    25950.18          1    17812500
2            Ituri        2700    327616416   121339.41          1    40447003
3    Kongo-Central        8766    280394925    31986.64          0    18451628
4       Sud-Ubangi        1391     99867211    71795.26          1    24681473
5        Nord-Kivu        1969     88841510    45120.12          1    51840000
6         Kinshasa        4671     55674538    11919.19          1     4577000
7         Sud Kivu        2480     53857969    21716.92          1     7254784
8        Haut-Uele        2740     44119318    16101.94          0    19076439
9          Lualaba        5507     27538563     5000.65          1    10500000
10         Mongala         670     13492023    20137.35          1     3216633
11      Tanganyika         792     11665218    14728.81          1     1291068
12  Kasaï-Oriental        2580     11016300     4269.88          1      635018
13          Lomami        4229     10019050     2369.13          1      980300
14   Kasaï-Central        1523      8967933     5888.33          1      799213
15     Haut-Lomami        2352      8099135     3443.51          1      173289
16          Kwango        3045      6610892     2171.06          1      151702
17     Nord-Ubangi        2206      5197292     2355.98          1      115825
18         Maniema        1504      4989564     3317.53          1      528743
19        Bas-Uele         815      3483205     4273.87          1      743184
20      Mai-Ndombe        2761      2933701     1062.55          1       40788
21           Kasaï        5588      2510301      449.23          1       68325
22         Sankuru         979      2352169     2402.62          1       80967
23        Équateur        4011      1874273      467.28          1       52131
24          Tshopo        2537      1638552      645.86          1       42113
25         Tshuapa        4266       988391      231.69          1       14420

In [13]:
# 3.3 Statistics by Year
query = """
SELECT 
    annees,
    COUNT(*) AS nb_records,
    SUM(Valeur) AS total_value,
    ROUND(AVG(Valeur), 2) AS avg_value
FROM vih_data
GROUP BY annees
ORDER BY annees
"""
print("Statistics by Year:")
display(run_sql(query))

Statistics by Year:

   annees  nb_records  total_value  avg_value
0    2020       15049    531028433   35286.63
1    2021       20851  12989553050  622970.27
2    2022       14941    381958380   25564.45
3    2023       17091    181090287   10595.65
4    2024       17879     42349858    2368.69

In [14]:
# 3.4 Statistics by Gender
query = """
SELECT 
    COALESCE(sexes, 'Non spécifié') AS gender,
    COUNT(*) AS nb_records,
    SUM(Valeur) AS total_value,
    ROUND(AVG(Valeur), 2) AS avg_value,
    ROUND(100.0 * SUM(Valeur) / (SELECT SUM(Valeur) FROM vih_data), 2) AS percentage
FROM vih_data
GROUP BY sexes
ORDER BY total_value DESC
"""
print("Statistics by Gender:")
display(run_sql(query))

Statistics by Gender:

         gender  nb_records  total_value   avg_value  percentage
0  Non spécifié        1797  13684955556  7615445.50       96.88
1      Masculin       39857    242257305     6078.16        1.71
2       Féminin       44157    198767147     4501.37        1.41

## Section 4: Data Aggregation

In [15]:
# 4.1 Total by Province and Year
query = """
SELECT 
    provinces,
    annees,
    SUM(Valeur) AS total_value,
    COUNT(*) AS nb_records
FROM vih_data
GROUP BY provinces, annees
ORDER BY provinces, annees
LIMIT 50
"""
print("Total by Province and Year (First 50 rows):")
display(run_sql(query))

Total by Province and Year (First 50 rows):

         provinces  annees  total_value  nb_records
0         Bas-Uele    2020      1247393          57
1         Bas-Uele    2021      1082808          38
2         Bas-Uele    2022       398842          42
3         Bas-Uele    2023       337320         285
4         Bas-Uele    2024       416842         393
5     Haut-Katanga    2020    223817381        3352
6     Haut-Katanga    2021     82973946        2490
7     Haut-Katanga    2022     12100171        2575
8     Haut-Katanga    2023     13948885        2473
9     Haut-Katanga    2024      6120851        2172
10     Haut-Lomami    2020      1718295         424
11     Haut-Lomami    2021      2650635         524
12     Haut-Lomami    2022      1422585         421
13     Haut-Lomami    2023      1105670         557
14     Haut-Lomami    2024      1201950         426
15       Haut-Uele    2020     39789673         571
16       Haut-Uele    2021      1082746         270
17       Haut-Uele    2022      1329757         499
18       Haut-Uele    2023      1108995         672
19       Haut-Uele    2024       808147         728
20           Ituri    2020     22418106         616
21           Ituri    2021      2786334         470
22           Ituri    2022    262230051         577
23           Ituri    2023     37823652         399
24           Ituri    2024      2358273         638
25           Kasaï    2020        81104         321
26           Kasaï    2021       311030        1137
27           Kasaï    2022        32833          52
28           Kasaï    2023       734985        2080
29           Kasaï    2024      1350349        1998
30   Kasaï-Central    2020      2754878          91
31   Kasaï-Central    2021      2069792         110
32   Kasaï-Central    2023      2033466         511
33   Kasaï-Central    2024      2109797         811
34  Kasaï-Oriental    2020      1707863         419
35  Kasaï-Oriental    2021      1785254         540
36  Kasaï-Oriental    2022      1816276         643
37  Kasaï-Oriental    2023      3508371         448
38  Kasaï-Oriental    2024      2198536         530
39        Kinshasa    2020      4394359        1207
40        Kinshasa    2021     41413054        1347
41        Kinshasa    2022      4733945        1370
42        Kinshasa    2023      5133180         747
43   Kongo-Central    2020    141595356         494
44   Kongo-Central    2021    132520727        7181
45   Kongo-Central    2022      1932676         428
46   Kongo-Central    2023      1617187         208
47   Kongo-Central    2024      2728979         455
48          Kwango    2020      1071178         449
49          Kwango    2021      1877027         385

In [16]:
# 4.2 Pivot: Values by Province and Year (using CASE WHEN)
query = """
SELECT 
    provinces,
    SUM(CASE WHEN annees = 2020 THEN Valeur ELSE 0 END) AS "2020",
    SUM(CASE WHEN annees = 2021 THEN Valeur ELSE 0 END) AS "2021",
    SUM(CASE WHEN annees = 2022 THEN Valeur ELSE 0 END) AS "2022",
    SUM(CASE WHEN annees = 2023 THEN Valeur ELSE 0 END) AS "2023",
    SUM(CASE WHEN annees = 2024 THEN Valeur ELSE 0 END) AS "2024",
    SUM(Valeur) AS total
FROM vih_data
GROUP BY provinces
ORDER BY total DESC
"""
print("Pivot Table: Values by Province and Year:")
display(run_sql(query))

Pivot Table: Values by Province and Year:

,provinces,2020,2021,2022,2023,2024,total
0,Kwilu,8784003,12673719052,25901895,680445,4184930,12713270325
1,Haut-Katanga,223817381,82973946,12100171,13948885,6120851,338961234
2,Ituri,22418106,2786334,262230051,37823652,2358273,327616416
3,Kongo-Central,141595356,132520727,1932676,1617187,2728979,280394925
4,Sud-Ubangi,656196,844542,9008258,88924939,433276,99867211
5,Nord-Kivu,65740084,9252406,6680598,5896053,1272369,88841510
6,Kinshasa,4394359,41413054,4733945,5133180,0,55674538
7,Sud Kivu,5029263,3184630,35784365,4343480,5516231,53857969
8,Haut-Uele,39789673,1082746,1329757,1108995,808147,44119318
9,Lualaba,1087879,17489098,5550019,1397745,2013822,27538563
10,Mongala,588933,7210768,4212698,1358006,121618,13492023
11,Tanganyika,2406428,1991534,3223956,3765772,277528,11665218
12,Kasaï-Oriental,1707863,1785254,1816276,3508371,2198536,11016300
13,Lomami,907212,2644438,1032696,1909253,3525451,10019050
14,Kasaï-Central,2754878,2069792,0,2033466,2109797,8967933
15,Haut-Lomami,1718295,2650635,1422585,1105670,1201950,8099135
16,Kwango,1071178,1877027,1372502,1381749,908436,6610892
17,Nord-Ubangi,647696,729829,1168030,987838,1663899,5197292
18,Maniema,2151266,496026,994852,565523,781897,4989564
19,Bas-Uele,1247393,1082808,398842,337320,416842,3483205
20,Mai-Ndombe,802105,585334,517488,528470,500304,2933701
21,Kasaï,81104,311030,32833,734985,1350349,2510301
22,Sankuru,619204,308914,408601,320612,694838,2352169
23,Équateur,401088,107861,38915,664366,662043,1874273
24,Tshopo,232325,25625,0,1014325,366277,1638552
25,Tshuapa,379165,409640,66371,0,133215,988391

In [17]:
# 4.3 Cross-tabulation: Gender vs Age Groups
query = """
SELECT 
    COALESCE(sexes, 'Non spécifié') AS gender,
    SUM(CASE WHEN tranches_ages = '< 10 ans' THEN Valeur ELSE 0 END) AS "< 10 ans",
    SUM(CASE WHEN tranches_ages = '10 à 14 ans' THEN Valeur ELSE 0 END) AS "10-14 ans",
    SUM(CASE WHEN tranches_ages = '15 à 19 ans' THEN Valeur ELSE 0 END) AS "15-19 ans",
    SUM(CASE WHEN tranches_ages = '20 à 24 ans' THEN Valeur ELSE 0 END) AS "20-24 ans",
    SUM(CASE WHEN tranches_ages = '25 à 49 ans' THEN Valeur ELSE 0 END) AS "25-49 ans",
    SUM(CASE WHEN tranches_ages = '>= 50 ans' THEN Valeur ELSE 0 END) AS ">= 50 ans"
FROM vih_data
GROUP BY sexes
"""
print("Cross-tabulation: Gender vs Age Groups:")
display(run_sql(query))

Cross-tabulation: Gender vs Age Groups:

,gender,< 10 ans,10-14 ans,15-19 ans,20-24 ans,25-49 ans,>= 50 ans
0,Non spécifié,0,0,0,0,0,0
1,Féminin,4464639,3202697,4714407,15406530,14989798,3739019
2,Masculin,4233818,2915386,4410070,20403463,68447004,2920650

## Section 5: UNAIDS 95-95-95 Cascade Analysis

In [18]:
# 5.1 UNAIDS Cascade - Total
query = """
SELECT 
    SUM(CASE WHEN indicateurs = 'Nombre de clients testés' THEN Valeur ELSE 0 END) AS total_tested,
    SUM(CASE WHEN indicateurs = 'Nombre de clients diagnostiqués VIH+' THEN Valeur ELSE 0 END) AS total_diagnosed,
    SUM(CASE WHEN indicateurs = 'Nombre de PVVIH sous TAR' THEN Valeur ELSE 0 END) AS total_on_tar,
    SUM(CASE WHEN indicateurs = 'Nombre  de PVVIH sous TAR qui ont supprimée la charge virale' THEN Valeur ELSE 0 END) AS total_viral_suppressed
FROM vih_data
"""
print("UNAIDS 95-95-95 Cascade (Total):")
display(run_sql(query))

UNAIDS 95-95-95 Cascade (Total):

   total_tested  total_diagnosed  total_on_tar  total_viral_suppressed
0      12419790           557343       5029684                  520142

In [19]:
# 5.2 UNAIDS Cascade by Year
query = """
SELECT 
    annees,
    SUM(CASE WHEN indicateurs = 'Nombre de clients testés' THEN Valeur ELSE 0 END) AS tested,
    SUM(CASE WHEN indicateurs = 'Nombre de clients diagnostiqués VIH+' THEN Valeur ELSE 0 END) AS diagnosed,
    SUM(CASE WHEN indicateurs = 'Nombre de PVVIH sous TAR' THEN Valeur ELSE 0 END) AS on_tar,
    SUM(CASE WHEN indicateurs = 'Nombre  de PVVIH sous TAR qui ont supprimée la charge virale' THEN Valeur ELSE 0 END) AS viral_suppressed
FROM vih_data
GROUP BY annees
ORDER BY annees
"""
print("UNAIDS Cascade by Year:")
display(run_sql(query))

UNAIDS Cascade by Year:

   annees   tested  diagnosed   on_tar  viral_suppressed
0    2020  2318304     160302   806607             86902
1    2021  2908045     139421   473850             85412
2    2022  2542447     125980  1019114            202792
3    2023  2569841      87153  1393070             74865
4    2024  2081153      44487  1337043             70171

In [20]:
# 5.3 UNAIDS Cascade by Province
query = """
SELECT 
    provinces,
    SUM(CASE WHEN indicateurs = 'Nombre de clients testés' THEN Valeur ELSE 0 END) AS tested,
    SUM(CASE WHEN indicateurs = 'Nombre de clients diagnostiqués VIH+' THEN Valeur ELSE 0 END) AS diagnosed,
    SUM(CASE WHEN indicateurs = 'Nombre de PVVIH sous TAR' THEN Valeur ELSE 0 END) AS on_tar,
    SUM(CASE WHEN indicateurs = 'Nombre  de PVVIH sous TAR qui ont supprimée la charge virale' THEN Valeur ELSE 0 END) AS viral_suppressed
FROM vih_data
GROUP BY provinces
ORDER BY tested DESC
"""
print("UNAIDS Cascade by Province:")
display(run_sql(query))

UNAIDS Cascade by Province:

         provinces   tested  diagnosed   on_tar  viral_suppressed
0     Haut-Katanga  2747903     178676  1884943            278193
1         Kinshasa  2157267     153660   221398            176468
2            Ituri   917322      56343   407364              1078
3         Sud Kivu   849096      17076   611070              3837
4        Nord-Kivu   695955      14021    97054             22933
5      Haut-Lomami   574700       8133   232855               267
6            Kwilu   521908       4597   168477               646
7    Kongo-Central   436409       7035   222605              1491
8      Nord-Ubangi   428042        915    24149               158
9           Kwango   357852       1263    48909                36
10      Tanganyika   296438       4672     4611               256
11         Mongala   289485       4611    56010                 0
12         Lualaba   283675      13941    44822             19652
13      Sud-Ubangi   236314       1143    51535               316
14  Kasaï-Oriental   216401       6508   234918              3360
15          Lomami   215526       1098    31441               196
16         Maniema   192688       6498   111442               130
17        Bas-Uele   178732       6981   139393               150
18      Mai-Ndombe   153604        716    29846               186
19       Haut-Uele   145898      25189    99157              6423
20           Kasaï   127615       3132    11286               197
21         Sankuru   121096       2950    10266                 0
22   Kasaï-Central    93410       3804   146969               990
23        Équateur    86994       1415    29921              1884
24          Tshopo    75315       5273    85160              1290
25         Tshuapa    20145      27693    24083                 5

In [21]:
# 5.4 Calculate Cascade Rates
query = """
WITH cascade AS (
    SELECT 
        annees,
        SUM(CASE WHEN indicateurs = 'Nombre de clients diagnostiqués VIH+' THEN Valeur ELSE 0 END) AS diagnosed,
        SUM(CASE WHEN indicateurs = 'Nombre de PVVIH sous TAR' THEN Valeur ELSE 0 END) AS on_tar,
        SUM(CASE WHEN indicateurs = 'Nombre  de PVVIH sous TAR qui ont supprimée la charge virale' THEN Valeur ELSE 0 END) AS viral_suppressed
    FROM vih_data
    GROUP BY annees
)
SELECT 
    annees,
    diagnosed,
    on_tar,
    viral_suppressed,
    ROUND(100.0 * on_tar / NULLIF(diagnosed, 0), 2) AS treatment_rate_pct,
    ROUND(100.0 * viral_suppressed / NULLIF(on_tar, 0), 2) AS suppression_rate_pct
FROM cascade
ORDER BY annees
"""
print("UNAIDS Cascade Rates by Year:")
display(run_sql(query))

UNAIDS Cascade Rates by Year:

,annees,diagnosed,on_tar,viral_suppressed,treatment_rate_pct,suppression_rate_pct
0,2020,160302,806607,86902,503.18,10.77
1,2021,139421,473850,85412,339.87,18.03
2,2022,125980,1019114,202792,808.95,19.90
3,2023,87153,1393070,74865,1598.42,5.37
4,2024,44487,1337043,70171,3005.47,5.25

## Section 6: Top N Analysis

In [22]:
# 6.1 Top 10 Provinces by Total Value
query = """
SELECT 
    provinces,
    SUM(Valeur) AS total_value,
    COUNT(*) AS nb_records,
    ROUND(AVG(Valeur), 2) AS avg_value
FROM vih_data
GROUP BY provinces
ORDER BY total_value DESC
LIMIT 10
"""
print("Top 10 Provinces by Total Value:")
display(run_sql(query))

Top 10 Provinces by Total Value:

       provinces  total_value  nb_records   avg_value
0          Kwilu  12713270325        2667  4766880.51
1   Haut-Katanga    338961234       13062    25950.18
2          Ituri    327616416        2700   121339.41
3  Kongo-Central    280394925        8766    31986.64
4     Sud-Ubangi     99867211        1391    71795.26
5      Nord-Kivu     88841510        1969    45120.12
6       Kinshasa     55674538        4671    11919.19
7       Sud Kivu     53857969        2480    21716.92
8      Haut-Uele     44119318        2740    16101.94
9        Lualaba     27538563        5507     5000.65

In [23]:
# 6.2 Top 10 Indicators by Total Value
query = """
SELECT 
    indicateurs,
    SUM(Valeur) AS total_value,
    COUNT(*) AS nb_occurrences
FROM vih_data
GROUP BY indicateurs
ORDER BY total_value DESC
LIMIT 10
"""
print("Top 10 Indicators by Total Value:")
display(run_sql(query))

Top 10 Indicators by Total Value:

,indicateurs,total_value,nb_occurrences
0,Montant absorbé (en FC) de financement interne...,6808965662,46
1,Montant (en FC) de financement interne alloué ...,6761934765,43
2,Nombre de préservatifs masculins distribués,156245289,6530
3,Montant de financement en intrants VIH par le ...,113166492,11
4,Nombre total de la population,106537209,193
5,Nombre de personnes touchés par les programmes...,69665166,18597
6,Nombre de femmes enceintes utilisant les servi...,15602132,464
7,Nombre de clients testés,12419790,4602
8,Nombre de clients ayant retiré les résultats,10731511,4348
9,Nombre total de nouveaux cas IST diagnostiqués...,10349544,3354

In [24]:
# 6.3 Top 10 Provinces for Male Condom Distribution
query = """
SELECT 
    provinces,
    SUM(Valeur) AS total_condoms
FROM vih_data
WHERE indicateurs = 'Nombre de préservatifs masculins distribués'
GROUP BY provinces
ORDER BY total_condoms DESC
LIMIT 10
"""
print("Top 10 Provinces for Male Condom Distribution:")
display(run_sql(query))

Top 10 Provinces for Male Condom Distribution:

        provinces  total_condoms
0       Nord-Kivu       70891144
1    Haut-Katanga       34796108
2        Sud Kivu        6600679
3         Lualaba        5725692
4        Kinshasa        4892325
5   Kongo-Central        4017664
6      Tanganyika        3858902
7          Lomami        3573813
8  Kasaï-Oriental        3440042
9           Ituri        3163399

In [25]:
# 6.4 Bottom 5 Provinces by Testing (areas needing attention)
query = """
SELECT 
    provinces,
    SUM(Valeur) AS total_tested
FROM vih_data
WHERE indicateurs = 'Nombre de clients testés'
GROUP BY provinces
ORDER BY total_tested ASC
LIMIT 5
"""
print("Bottom 5 Provinces by Testing (Areas Needing Attention):")
display(run_sql(query))

Bottom 5 Provinces by Testing (Areas Needing Attention):

       provinces  total_tested
0        Tshuapa         20145
1         Tshopo         75315
2       Équateur         86994
3  Kasaï-Central         93410
4        Sankuru        121096

## Section 7: Year-over-Year Analysis

In [26]:
# 7.1 Year-over-Year Growth Rate
query = """
WITH yearly_totals AS (
    SELECT 
        annees,
        SUM(Valeur) AS total_value
    FROM vih_data
    GROUP BY annees
)
SELECT 
    y1.annees,
    y1.total_value,
    y2.total_value AS previous_year_value,
    ROUND(100.0 * (y1.total_value - y2.total_value) / NULLIF(y2.total_value, 0), 2) AS yoy_growth_pct
FROM yearly_totals y1
LEFT JOIN yearly_totals y2 ON y1.annees = y2.annees + 1
ORDER BY y1.annees
"""
print("Year-over-Year Growth Rate:")
display(run_sql(query))

Year-over-Year Growth Rate:

   annees  total_value  previous_year_value  yoy_growth_pct
0    2020    531028433                  NaN             NaN
1    2021  12989553050         5.310284e+08         2346.11
2    2022    381958380         1.298955e+10          -97.06
3    2023    181090287         3.819584e+08          -52.59
4    2024     42349858         1.810903e+08          -76.61

In [27]:
# 7.2 Year-over-Year Growth for TAR (Treatment)
query = """
WITH tar_yearly AS (
    SELECT 
        annees,
        SUM(Valeur) AS total_on_tar
    FROM vih_data
    WHERE indicateurs = 'Nombre de PVVIH sous TAR'
    GROUP BY annees
)
SELECT 
    t1.annees,
    t1.total_on_tar,
    t2.total_on_tar AS previous_year,
    t1.total_on_tar - t2.total_on_tar AS absolute_change,
    ROUND(100.0 * (t1.total_on_tar - t2.total_on_tar) / NULLIF(t2.total_on_tar, 0), 2) AS pct_change
FROM tar_yearly t1
LEFT JOIN tar_yearly t2 ON t1.annees = t2.annees + 1
ORDER BY t1.annees
"""
print("Year-over-Year Growth for Treatment (TAR):")
display(run_sql(query))

Year-over-Year Growth for Treatment (TAR):

   annees  total_on_tar  previous_year  absolute_change  pct_change
0    2020        806607            NaN              NaN         NaN
1    2021        473850       806607.0        -332757.0      -41.25
2    2022       1019114       473850.0         545264.0      115.07
3    2023       1393070      1019114.0         373956.0       36.69
4    2024       1337043      1393070.0         -56027.0       -4.02

## Section 8: Window Functions

In [28]:
# 8.1 Rank Provinces by Total Value
query = """
SELECT 
    provinces,
    SUM(Valeur) AS total_value,
    RANK() OVER (ORDER BY SUM(Valeur) DESC) AS rank_by_value,
    ROUND(100.0 * SUM(Valeur) / (SELECT SUM(Valeur) FROM vih_data), 2) AS pct_of_total
FROM vih_data
GROUP BY provinces
ORDER BY total_value DESC
"""
print("Province Ranking by Total Value:")
display(run_sql(query))

Province Ranking by Total Value:

         provinces  total_value  rank_by_value  pct_of_total
0            Kwilu  12713270325              1         90.00
1     Haut-Katanga    338961234              2          2.40
2            Ituri    327616416              3          2.32
3    Kongo-Central    280394925              4          1.98
4       Sud-Ubangi     99867211              5          0.71
5        Nord-Kivu     88841510              6          0.63
6         Kinshasa     55674538              7          0.39
7         Sud Kivu     53857969              8          0.38
8        Haut-Uele     44119318              9          0.31
9          Lualaba     27538563             10          0.19
10         Mongala     13492023             11          0.10
11      Tanganyika     11665218             12          0.08
12  Kasaï-Oriental     11016300             13          0.08
13          Lomami     10019050             14          0.07
14   Kasaï-Central      8967933             15          0.06
15     Haut-Lomami      8099135             16          0.06
16          Kwango      6610892             17          0.05
17     Nord-Ubangi      5197292             18          0.04
18         Maniema      4989564             19          0.04
19        Bas-Uele      3483205             20          0.02
20      Mai-Ndombe      2933701             21          0.02
21           Kasaï      2510301             22          0.02
22         Sankuru      2352169             23          0.02
23        Équateur      1874273             24          0.01
24          Tshopo      1638552             25          0.01
25         Tshuapa       988391             26          0.01

In [29]:
# 8.2 Rank Provinces within Each Year
query = """
SELECT 
    annees,
    provinces,
    SUM(Valeur) AS total_value,
    RANK() OVER (PARTITION BY annees ORDER BY SUM(Valeur) DESC) AS rank_in_year
FROM vih_data
GROUP BY annees, provinces
HAVING rank_in_year <= 5
ORDER BY annees, rank_in_year
"""
print("Top 5 Provinces per Year:")
display(run_sql(query))

Top 5 Provinces per Year:

DatabaseError: Execution failed on sql '
SELECT
    annees,
    provinces,
    SUM(Valeur) AS total_value,
    RANK() OVER (PARTITION BY annees ORDER BY SUM(Valeur) DESC) AS rank_in_year
FROM vih_data
GROUP BY annees, provinces
HAVING rank_in_year <= 5
ORDER BY annees, rank_in_year
': misuse of aliased window function rank_in_year

In [ ]:
# 8.3 Cumulative Sum by Year
query = """
SELECT 
    annees,
    trimestres,
    SUM(Valeur) AS quarterly_value,
    SUM(SUM(Valeur)) OVER (PARTITION BY annees ORDER BY trimestres) AS cumulative_value
FROM vih_data
GROUP BY annees, trimestres
ORDER BY annees, trimestres
"""
print("Cumulative Sum by Year and Quarter:")
display(run_sql(query))

In [ ]:
# 8.4 Running Average
query = """
SELECT 
    annees,
    SUM(Valeur) AS yearly_total,
    ROUND(AVG(SUM(Valeur)) OVER (ORDER BY annees ROWS BETWEEN UNBOUNDED PRECEDING AND CURRENT ROW), 2) AS running_avg
FROM vih_data
GROUP BY annees
ORDER BY annees
"""
print("Running Average by Year:")
display(run_sql(query))

## Section 9: Comparative Analysis

In [ ]:
# 9.1 Province Comparison: Above/Below Average
query = """
WITH province_totals AS (
    SELECT provinces, SUM(Valeur) AS total_value
    FROM vih_data
    GROUP BY provinces
),
overall_avg AS (
    SELECT AVG(total_value) AS avg_value FROM province_totals
)
SELECT 
    p.provinces,
    p.total_value,
    ROUND(o.avg_value, 2) AS national_average,
    CASE 
        WHEN p.total_value > o.avg_value THEN 'Above Average'
        WHEN p.total_value < o.avg_value THEN 'Below Average'
        ELSE 'Equal to Average'
    END AS performance_status,
    ROUND(100.0 * (p.total_value - o.avg_value) / o.avg_value, 2) AS pct_diff_from_avg
FROM province_totals p, overall_avg o
ORDER BY p.total_value DESC
"""
print("Province Performance vs National Average:")
display(run_sql(query))

In [ ]:
# 9.2 Gender Comparison by Province
query = """
SELECT 
    provinces,
    SUM(CASE WHEN sexes = 'Masculin' THEN Valeur ELSE 0 END) AS male_value,
    SUM(CASE WHEN sexes = 'Féminin' THEN Valeur ELSE 0 END) AS female_value,
    ROUND(100.0 * SUM(CASE WHEN sexes = 'Masculin' THEN Valeur ELSE 0 END) / 
          NULLIF(SUM(CASE WHEN sexes IN ('Masculin', 'Féminin') THEN Valeur ELSE 0 END), 0), 2) AS male_pct,
    ROUND(100.0 * SUM(CASE WHEN sexes = 'Féminin' THEN Valeur ELSE 0 END) / 
          NULLIF(SUM(CASE WHEN sexes IN ('Masculin', 'Féminin') THEN Valeur ELSE 0 END), 0), 2) AS female_pct
FROM vih_data
WHERE sexes IS NOT NULL
GROUP BY provinces
ORDER BY provinces
"""
print("Gender Comparison by Province:")
display(run_sql(query))

## Section 10: Data Quality Checks

In [ ]:
# 10.1 Check for NULL values
query = """
SELECT 
    SUM(CASE WHEN provinces IS NULL THEN 1 ELSE 0 END) AS null_provinces,
    SUM(CASE WHEN annees IS NULL THEN 1 ELSE 0 END) AS null_annees,
    SUM(CASE WHEN trimestres IS NULL THEN 1 ELSE 0 END) AS null_trimestres,
    SUM(CASE WHEN indicateurs IS NULL THEN 1 ELSE 0 END) AS null_indicateurs,
    SUM(CASE WHEN sexes IS NULL THEN 1 ELSE 0 END) AS null_sexes,
    SUM(CASE WHEN tranches_ages IS NULL THEN 1 ELSE 0 END) AS null_tranches_ages,
    SUM(CASE WHEN Valeur IS NULL THEN 1 ELSE 0 END) AS null_valeur
FROM vih_data
"""
print("NULL Values Check:")
display(run_sql(query))

In [ ]:
# 10.2 Check for Negative Values
query = """
SELECT COUNT(*) AS negative_values_count
FROM vih_data 
WHERE Valeur < 0
"""
print("Negative Values Check:")
display(run_sql(query))

In [ ]:
# 10.3 Data Completeness Check by Year
query = """
SELECT 
    annees,
    COUNT(DISTINCT provinces) AS provinces_covered,
    COUNT(DISTINCT trimestres) AS quarters_covered,
    COUNT(DISTINCT indicateurs) AS indicators_tracked,
    COUNT(*) AS total_records
FROM vih_data
GROUP BY annees
ORDER BY annees
"""
print("Data Completeness by Year:")
display(run_sql(query))

## Section 11: Advanced Queries with CTEs

In [ ]:
# 11.1 Multi-step Analysis: Provincial Performance Scoring
query = """
WITH province_metrics AS (
    SELECT 
        provinces,
        SUM(CASE WHEN indicateurs = 'Nombre de clients testés' THEN Valeur ELSE 0 END) AS testing_score,
        SUM(CASE WHEN indicateurs = 'Nombre de PVVIH sous TAR' THEN Valeur ELSE 0 END) AS treatment_score,
        SUM(CASE WHEN indicateurs = 'Nombre  de PVVIH sous TAR qui ont supprimée la charge virale' THEN Valeur ELSE 0 END) AS suppression_score
    FROM vih_data
    GROUP BY provinces
)
SELECT 
    provinces,
    testing_score,
    treatment_score,
    suppression_score,
    (testing_score + treatment_score + suppression_score) AS composite_score,
    NTILE(4) OVER (ORDER BY (testing_score + treatment_score + suppression_score) DESC) AS performance_quartile
FROM province_metrics
ORDER BY composite_score DESC
"""
print("Provincial Performance Scoring:")
display(run_sql(query))

In [ ]:
# 11.2 Trend Classification
query = """
WITH yearly_change AS (
    SELECT 
        provinces,
        annees,
        SUM(Valeur) AS total_value
    FROM vih_data
    GROUP BY provinces, annees
),
with_prev AS (
    SELECT 
        y1.provinces,
        y1.annees,
        y1.total_value,
        y2.total_value AS prev_value
    FROM yearly_change y1
    LEFT JOIN yearly_change y2 ON y1.provinces = y2.provinces AND y1.annees = y2.annees + 1
)
SELECT 
    provinces,
    annees,
    total_value,
    prev_value,
    CASE 
        WHEN prev_value IS NULL THEN 'Baseline'
        WHEN total_value > prev_value * 1.1 THEN 'Significant Increase (>10%)'
        WHEN total_value > prev_value THEN 'Moderate Increase'
        WHEN total_value < prev_value * 0.9 THEN 'Significant Decrease (>10%)'
        WHEN total_value < prev_value THEN 'Moderate Decrease'
        ELSE 'Stable'
    END AS trend_classification
FROM with_prev
WHERE annees = 2024
ORDER BY provinces
"""
print("Trend Classification (2024 vs 2023):")
display(run_sql(query))

## Section 12: KPI Reporting Queries

In [ ]:
# 12.1 Executive Summary
query = """
SELECT 
    'HIV Data Analysis Summary - DRC' AS report_title,
    MIN(annees) AS period_start,
    MAX(annees) AS period_end,
    COUNT(DISTINCT provinces) AS provinces_covered,
    COUNT(DISTINCT indicateurs) AS indicators_tracked,
    SUM(Valeur) AS total_program_value,
    COUNT(*) AS total_records
FROM vih_data
"""
print("Executive Summary:")
display(run_sql(query))

In [ ]:
# 12.2 Key Performance Indicators by Year
query = """
SELECT 
    annees,
    SUM(CASE WHEN indicateurs = 'Nombre de clients testés' THEN Valeur ELSE 0 END) AS kpi_testing,
    SUM(CASE WHEN indicateurs = 'Nombre de PVVIH sous TAR' THEN Valeur ELSE 0 END) AS kpi_treatment,
    SUM(CASE WHEN indicateurs = 'Nombre  de PVVIH sous TAR qui ont supprimée la charge virale' THEN Valeur ELSE 0 END) AS kpi_viral_suppression,
    SUM(CASE WHEN indicateurs = 'Nombre de préservatifs masculins distribués' THEN Valeur ELSE 0 END) AS kpi_prevention
FROM vih_data
GROUP BY annees
ORDER BY annees
"""
print("Key Performance Indicators by Year:")
display(run_sql(query))

In [ ]:
# 12.3 Provincial Dashboard Data
query = """
SELECT 
    provinces,
    SUM(Valeur) AS total_value,
    COUNT(DISTINCT annees) AS years_active,
    ROUND(100.0 * SUM(Valeur) / (SELECT SUM(Valeur) FROM vih_data), 2) AS national_share_pct,
    RANK() OVER (ORDER BY SUM(Valeur) DESC) AS national_rank
FROM vih_data
GROUP BY provinces
ORDER BY total_value DESC
"""
print("Provincial Dashboard Data:")
display(run_sql(query))

## Section 13: Clean Up

In [ ]:
# Close database connection
conn.close()
print("Database connection closed.")

---

## Summary

This notebook demonstrates SQL skills including:

1. **Basic Queries:** SELECT, WHERE, ORDER BY, LIMIT
2. **Aggregations:** COUNT, SUM, AVG, MIN, MAX, GROUP BY
3. **Conditional Logic:** CASE WHEN, COALESCE, NULLIF
4. **Joins:** LEFT JOIN for YoY analysis
5. **CTEs:** Common Table Expressions for complex queries
6. **Window Functions:** RANK, NTILE, cumulative sums, running averages
7. **Subqueries:** Nested queries for calculations
8. **Data Quality:** NULL checks, completeness analysis
9. **Pivot Tables:** Using CASE WHEN for cross-tabulation
10. **KPI Reporting:** Executive summaries and dashboards

---

**Author:** Bienvenu Mwenyemali  
**GitHub:** [bmwenyemali](https://github.com/bmwenyemali)  
**Repository:** [vihdataproDataAnalysis](https://github.com/bmwenyemali/vihdataproDataAnalysis)